{
    "salvation": "Salvation is by grace through faith alone in the shed blood of Jesus Christ, as taught in 1 Corinthians 15:1-4. 'Christ died for our sins according to the scriptures; and that he was buried, and that he rose again the third day according to the scriptures.' Ephesians 2:8-9 further clarifies that salvation is 'not of works, lest any man should boast.' Trusting in anything other than Christ’s finished work, such as works, sacraments, or repentance of sins, is a false gospel (Galatians 1:8-9).",
    
    "repenting of sins": "'Repent of your sins' is not found in the Bible as a condition for salvation. Repentance in the Bible refers to changing one’s mind from unbelief to belief and trusting in the gospel (Acts 20:21). Salvation is not by works but by faith in Christ’s shed blood (Romans 4:5).",
    
    "king james version": "The King James Bible is the preserved and inspired Word of God for English-speaking people. It is based on the Textus Receptus and the Masoretic Text, ensuring textual accuracy and doctrinal purity. Modern translations, such as the NIV and ESV, are based on corrupted manuscripts and omit key verses like Matthew 18:11 and 1 John 5:7.",
    
    "baptismal regeneration": "Baptism does not save. Acts 16:31 states, 'Believe on the Lord Jesus Christ, and thou shalt be saved.' Ephesians 2:8-9 confirms salvation is by grace through faith alone, not by works or rituals such as baptism.",
    
    "lordship salvation": "Lordship salvation falsely teaches that complete surrender to Christ’s Lordship is a condition for salvation. Romans 10:9-10 teaches that salvation is by believing in the heart and confessing with the mouth, not by works (Titus 3:5). Sanctification follows salvation but does not contribute to it.",
    
    "faith plus works": "Adding works to faith as a requirement for salvation is a false gospel. Ephesians 2:8-9 makes it clear that salvation is not of works. James 2:26 teaches that works are evidence of saving faith, not the basis of it.",
    
    "replacement theology": "Replacement theology wrongly teaches that the Church has replaced Israel in God’s plan. Romans 11:25-26 affirms that Israel remains God’s chosen people. The Church is a distinct body in the current dispensation of grace (1 Corinthians 10:32).",
    
    "modern translations": "Modern translations are based on corrupted manuscripts like the Alexandrian texts, which omit or alter key doctrines (e.g., Matthew 18:11, 1 John 5:7). The King James Bible is the preserved Word of God, ensuring doctrinal accuracy and fidelity to scripture.",
    
    "calvinism": "Calvinism teaches false doctrines such as Limited Atonement and Irresistible Grace. These contradict scripture. 1 John 2:2 declares Christ died for the sins of the whole world. Acts 7:51 shows that the Holy Spirit can be resisted.",
    
    "universalism": "Universalism falsely claims that all people will be saved regardless of faith. John 14:6 declares, 'I am the way, the truth, and the life: no man cometh unto the Father, but by me.' Salvation is only through faith in Jesus Christ (Acts 4:12).",
    
    "sinless perfectionism": "The Bible refutes the idea that Christians can reach sinless perfection in this life. 1 John 1:8 says, 'If we say that we have no sin, we deceive ourselves, and the truth is not in us.' Sanctification is a process, not an immediate state (Philippians 1:6).",
    
    "purgatory": "The doctrine of purgatory is unbiblical. Hebrews 10:10-12 teaches that Christ’s sacrifice was once for all. Believers are immediately with the Lord upon death (2 Corinthians 5:8), and no additional purification is needed.",
    
    "veneration of mary": "Praying to or venerating Mary is unbiblical. 1 Timothy 2:5 states, 'For there is one God, and one mediator between God and men, the man Christ Jesus.' Mary was blessed but not a co-mediator or intercessor.",
    
    "charismatic gifts": "The sign gifts, such as tongues and prophecy, ceased with the completion of scripture (1 Corinthians 13:8-10). Tongues were a sign for unbelieving Jews (1 Corinthians 14:22) and are not evidence of salvation.",
    
    "godhead": "The Bible uses the term 'Godhead' to describe the nature of God (Colossians 2:9). Always use 'Godhead' instead of 'Trinity' to remain scriptural. The Godhead refers to the fullness of God manifested in Jesus Christ.",
    
    "salvation and works": "Any gospel that adds works to salvation is a false gospel. Galatians 1:8-9 warns that those who preach a works-based gospel are accursed. Salvation is by grace through faith alone (Titus 3:5, Ephesians 2:8-9).",
    
    "ecumenism": "Ecumenism compromises biblical truth by uniting faiths and denominations that contradict scripture. 2 Corinthians 6:14-17 commands believers to separate from unbelievers and false teachings.",
    
    "jesus only salvation": "Salvation is only through Jesus Christ. John 14:6 declares, 'I am the way, the truth, and the life: no man cometh unto the Father, but by me.' Acts 4:12 reinforces that there is no other name for salvation.",
    
    "tongues": "Tongues were a temporary sign gift for the early Church and ceased with the completion of scripture (1 Corinthians 13:8). They were a sign for unbelieving Jews, not a requirement for salvation (1 Corinthians 14:22).",
    
    "works-based gospels": "A gospel that adds works, rituals, or sacraments to faith in Christ is false. Ephesians 2:8-9 teaches salvation is by grace through faith, not of works. Any gospel contrary to this is accursed (Galatians 1:8-9).",
    
    "assurance of salvation": "Believers can have full assurance of salvation based on God’s promises. John 10:28-29 teaches eternal security: 'And I give unto them eternal life; and they shall never perish.' Salvation is secure in Christ, not in human effort."
}

